<a href="https://colab.research.google.com/github/Ganapathi-tech/ganapathi-tech-Ganesh/blob/main/Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
d1 = {
    "Stdid" :[111,222,333,444,555],
    "StdName" : ["Shanti","Naren","Kumar","Shiva","Ram"],
    "StdClass" : [10, 7,9,10,12], 
    "City" : ["Hyd","Viz", "Hyd", "Che", "Viz"] }


d2 = {
    "ENGLISH" :[88,77,81,67,75],
    "SCIENCE" : [89,72,83,75,79],
    "COMPUTERS" : [91,77,82,81,85]
}

d3 = {
    "Maths" :[88,77,81,67,75],
    "SOCIAL" : [89,72,83,75,79],
    "TELUGU" : [91,77,82,81,85]
}

In [ ]:
dfd1 = pd.DataFrame(d1)

In [ ]:
dfd1

   Stdid StdName  StdClass City
0    111  Shanti        10  Hyd
1    222   Naren         7  Viz
2    333   Kumar         9  Hyd
3    444   Shiva        10  Che
4    555     Ram        12  Viz

In [ ]:
dfd2 = pd.DataFrame(d2)

In [ ]:
dfd2

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
dfstd = dfd1.join(dfd2)

In [ ]:
dfstd

   Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10  Hyd       88       89         91
1    222   Naren         7  Viz       77       72         77
2    333   Kumar         9  Hyd       81       83         82
3    444   Shiva        10  Che       67       75         81
4    555     Ram        12  Viz       75       79         85

In [ ]:
dfstd["Total"] = dfstd["ENGLISH"] + dfstd["SCIENCE"] + dfstd["COMPUTERS"]

In [ ]:
dfstd["AVERAGE"] = dfstd["Total"]/3

In [ ]:
dfstd

   Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
0    111  Shanti        10  Hyd       88       89         91    268  89.333333
1    222   Naren         7  Viz       77       72         77    226  75.333333
2    333   Kumar         9  Hyd       81       83         82    246  82.000000
3    444   Shiva        10  Che       67       75         81    223  74.333333
4    555     Ram        12  Viz       75       79         85    239  79.666667

In [ ]:
gb_city =  dfstd.groupby("City")

In [ ]:
print(gb_city)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fbf1857d890>

In [ ]:
gb_city.groups

{'Che': [3], 'Hyd': [0, 2], 'Viz': [1, 4]}

In [ ]:
gb_city

In [ ]:
import time
for i in gb_city:
  print(i)
  time.sleep(2)

('Che',    Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
3    444   Shiva        10  Che       67       75         81    223  74.333333)
('Hyd',    Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
0    111  Shanti        10  Hyd       88       89         91    268  89.333333
2    333   Kumar         9  Hyd       81       83         82    246  82.000000)
('Viz',    Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
1    222   Naren         7  Viz       77       72         77    226  75.333333
4    555     Ram        12  Viz       75       79         85    239  79.666667)

In [ ]:
for x, y in gb_city:
  print(x)
  print()
  print(y)
  print("**************")
  print()

Che

   Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
3    444   Shiva        10  Che       67       75         81    223  74.333333
**************

Hyd

   Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
0    111  Shanti        10  Hyd       88       89         91    268  89.333333
2    333   Kumar         9  Hyd       81       83         82    246  82.000000
**************

Viz

   Stdid StdName  StdClass City  ENGLISH  SCIENCE  COMPUTERS  Total    AVERAGE
1    222   Naren         7  Viz       77       72         77    226  75.333333
4    555     Ram        12  Viz       75       79         85    239  79.666667
**************

In [ ]:
dfstd.to_csv("std.csv")

In [ ]:
std1 = pd.read_csv("std1.csv")

In [ ]:
std1

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS
0     111   Shanti      10   Hyd       88       89         91
1     222    Naren       8   Viz       77       72         77
2     333    Kumar       9   Hyd       81       83         82
3     444    Shiva      10   Che       67       75         81
4     555      Ram      12   Viz       75       79         85
5     666    Meena      10   Blr       89       81         75
6     777      AAA       8   Hyd       72       67         79
7     888      BBB       9   Che       83       75         81
8     999      CCC      10   Viz       75       89         67
9    1110      EEE      12   Che       79       72         75
10   1221      FFF      10   Viz       82       83         75
11   1332      GGG      12   Blr       81       75         79
12   1443      HHH      10   Hyd       85       89         82
13   1554      JJJ      11   Hyd       67       72         81
14   1665      KKK      12   Viz       75       83         82
15   2221   Naren1       8   Viz       77       72         77
16   2233  Kumar22       9   Hyd       81       83         82
17   2234  Shiva33      10   Che       67       75         81
18   2235    Ram44      12   Viz       75       79         85
19   2236  Meena55      10   Blr       89       81         75
20   2237     AAA1       8   Hyd       72       67         79
21   2238     BBB2       9   Che       83       75         81
22   2239     CCC3      10   Viz       75       89         67

In [ ]:
std1["TOTAL"] = std1["ENGLISH"] + std1["SCIENCE"] + std1["COMPUTERS"]

In [ ]:
std1["AVERAGE"] = std1["TOTAL"]/3

In [ ]:
std1

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
1     222    Naren       8   Viz       77       72         77    226  75.333333
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
3     444    Shiva      10   Che       67       75         81    223  74.333333
4     555      Ram      12   Viz       75       79         85    239  79.666667
5     666    Meena      10   Blr       89       81         75    245  81.666667
6     777      AAA       8   Hyd       72       67         79    218  72.666667
7     888      BBB       9   Che       83       75         81    239  79.666667
8     999      CCC      10   Viz       75       89         67    231  77.000000
9    1110      EEE      12   Che       79       72         75    226  75.333333
10   1221      FFF      10   Viz       82       83         75    240  80.000000
11   1332      GGG      12   Blr       81       75         79    235  78.333333
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
13   1554      JJJ      11   Hyd       67       72         81    220  73.333333
14   1665      KKK      12   Viz       75       83         82    240  80.000000
15   2221   Naren1       8   Viz       77       72         77    226  75.333333
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
18   2235    Ram44      12   Viz       75       79         85    239  79.666667
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
20   2237     AAA1       8   Hyd       72       67         79    218  72.666667
21   2238     BBB2       9   Che       83       75         81    239  79.666667
22   2239     CCC3      10   Viz       75       89         67    231  77.000000

In [ ]:
gb_sclass = std1.groupby("SClass")

In [ ]:
gb_sclass

In [ ]:
gb_sclass.groups

{8: [1, 6, 15, 20], 9: [2, 7, 16, 21], 10: [0, 3, 5, 8, 10, 12, 17, 19, 22], 11: [13], 12: [4, 9, 11, 14, 18]}

In [ ]:
for i in gb_sclass:
  print(i)

(8,     StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
6     777     AAA       8   Hyd       72       67         79    218  72.666667
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
20   2237    AAA1       8   Hyd       72       67         79    218  72.666667)
(9,     StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
7     888      BBB       9   Che       83       75         81    239  79.666667
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
21   2238     BBB2       9   Che       83       75         81    239  79.666667)
(10,     StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
3     444    Shiva      10   Che       67       75         81    223  74.333333
5     666    Meena      10   Blr       89       81         75    245  81.666667
8     999      CCC      10   Viz       75       89         67    231  77.000000
10   1221      FFF      10   Viz       82       83         75    240  80.000000
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
22   2239     CCC3      10   Viz       75       89         67    231  77.000000)
(11,     StdID SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
13   1554   JJJ      11   Hyd       67       72         81    220  73.333333)
(12,     StdID  SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
4     555    Ram      12   Viz       75       79         85    239  79.666667
9    1110    EEE      12   Che       79       72         75    226  75.333333
11   1332    GGG      12   Blr       81       75         79    235  78.333333
14   1665    KKK      12   Viz       75       83         82    240  80.000000
18   2235  Ram44      12   Viz       75       79         85    239  79.666667)

In [ ]:
for x,y in gb_sclass:
  print()
  print("CLASS :",x)
  print()
  print(y)
  print("*************************")

CLASS : 8

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
6     777     AAA       8   Hyd       72       67         79    218  72.666667
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
20   2237    AAA1       8   Hyd       72       67         79    218  72.666667
*************************

CLASS : 9

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
7     888      BBB       9   Che       83       75         81    239  79.666667
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
21   2238     BBB2       9   Che       83       75         81    239  79.666667
*************************

CLASS : 10

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
3     444    Shiva      10   Che       67       75         81    223  74.333333
5     666    Meena      10   Blr       89       81         75    245  81.666667
8     999      CCC      10   Viz       75       89         67    231  77.000000
10   1221      FFF      10   Viz       82       83         75    240  80.000000
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
22   2239     CCC3      10   Viz       75       89         67    231  77.000000
*************************

CLASS : 11

    StdID SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
13   1554   JJJ      11   Hyd       67       72         81    220  73.333333
*************************

CLASS : 12

    StdID  SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
4     555    Ram      12   Viz       75       79         85    239  79.666667
9    1110    EEE      12   Che       79       72         75    226  75.333333
11   1332    GGG      12   Blr       81       75         79    235  78.333333
14   1665    KKK      12   Viz       75       83         82    240  80.000000
18   2235  Ram44      12   Viz       75       79         85    239  79.666667
*************************

In [ ]:
gb_sclass.count()

        StdID  SName  SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL  AVERAGE
SClass
8           4      4      4        4        4          4      4        4
9           4      4      4        4        4          4      4        4
10          9      9      9        9        9          9      9        9
11          1      1      1        1        1          1      1        1
12          5      5      5        5        5          5      5        5

In [ ]:
df_10 = gb_sclass.get_group(10)

In [ ]:
df_10

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
3     444    Shiva      10   Che       67       75         81    223  74.333333
5     666    Meena      10   Blr       89       81         75    245  81.666667
8     999      CCC      10   Viz       75       89         67    231  77.000000
10   1221      FFF      10   Viz       82       83         75    240  80.000000
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
22   2239     CCC3      10   Viz       75       89         67    231  77.000000

In [ ]:
gb_sclass.get_group(10)["SClass"].count()

9

In [ ]:
df_10["COMPUTERS"].max()

91

In [ ]:
df_10["COMPUTERS"] == df_10["COMPUTERS"].max()

0      True
3     False
5     False
8     False
10    False
12    False
17    False
19    False
22    False
Name: COMPUTERS, dtype: bool

In [ ]:
df_10[ df_10["COMPUTERS"] == df_10["COMPUTERS"].max() ]

   StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0    111  Shanti      10   Hyd       88       89         91    268  89.333333

In [ ]:
gb_sclass.get_group(8)

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
6     777     AAA       8   Hyd       72       67         79    218  72.666667
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
20   2237    AAA1       8   Hyd       72       67         79    218  72.666667

In [ ]:
gb_sclass.get_group(9)

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
7     888      BBB       9   Che       83       75         81    239  79.666667
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
21   2238     BBB2       9   Che       83       75         81    239  79.666667

In [ ]:
gb_sclass.get_group(8)

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
6     777     AAA       8   Hyd       72       67         79    218  72.666667
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
20   2237    AAA1       8   Hyd       72       67         79    218  72.666667

In [ ]:
df_8 =gb_sclass.get_group(8)

In [ ]:
df_8

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
6     777     AAA       8   Hyd       72       67         79    218  72.666667
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
20   2237    AAA1       8   Hyd       72       67         79    218  72.666667

In [ ]:
df_8["TOTAL"].max()

226

In [ ]:
# df_8["TOTAL"] == 226

df_8["TOTAL"] == df_8["TOTAL"].max()

1      True
6     False
15     True
20    False
Name: TOTAL, dtype: bool

In [ ]:
df_8[df_8["TOTAL"] == df_8["TOTAL"].max()]

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
15   2221  Naren1       8   Viz       77       72         77    226  75.333333

## TRYING TO FIND MAXIMUM NUMBER OF STUDENTS BASED ON *CITY*

In [ ]:
std1

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
1     222    Naren       8   Viz       77       72         77    226  75.333333
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
3     444    Shiva      10   Che       67       75         81    223  74.333333
4     555      Ram      12   Viz       75       79         85    239  79.666667
5     666    Meena      10   Blr       89       81         75    245  81.666667
6     777      AAA       8   Hyd       72       67         79    218  72.666667
7     888      BBB       9   Che       83       75         81    239  79.666667
8     999      CCC      10   Viz       75       89         67    231  77.000000
9    1110      EEE      12   Che       79       72         75    226  75.333333
10   1221      FFF      10   Viz       82       83         75    240  80.000000
11   1332      GGG      12   Blr       81       75         79    235  78.333333
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
13   1554      JJJ      11   Hyd       67       72         81    220  73.333333
14   1665      KKK      12   Viz       75       83         82    240  80.000000
15   2221   Naren1       8   Viz       77       72         77    226  75.333333
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
18   2235    Ram44      12   Viz       75       79         85    239  79.666667
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
20   2237     AAA1       8   Hyd       72       67         79    218  72.666667
21   2238     BBB2       9   Che       83       75         81    239  79.666667
22   2239     CCC3      10   Viz       75       89         67    231  77.000000

In [ ]:
#1st step.. groupby based on column

gb_city = std1.groupby("SCity")

In [ ]:
gb_city.groups

{'Blr': [5, 11, 19], 'Che': [3, 7, 9, 17, 21], 'Hyd': [0, 2, 6, 12, 13, 16, 20], 'Viz': [1, 4, 8, 10, 14, 15, 18, 22]}

In [ ]:
for i, j in gb_city:
  print()
  print("CITY : ", i)
  print()
  print(j)
  print("*****************")

CITY :  Blr

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
5     666    Meena      10   Blr       89       81         75    245  81.666667
11   1332      GGG      12   Blr       81       75         79    235  78.333333
19   2236  Meena55      10   Blr       89       81         75    245  81.666667
*****************

CITY :  Che

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
3     444    Shiva      10   Che       67       75         81    223  74.333333
7     888      BBB       9   Che       83       75         81    239  79.666667
9    1110      EEE      12   Che       79       72         75    226  75.333333
17   2234  Shiva33      10   Che       67       75         81    223  74.333333
21   2238     BBB2       9   Che       83       75         81    239  79.666667
*****************

CITY :  Hyd

    StdID    SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
0     111   Shanti      10   Hyd       88       89         91    268  89.333333
2     333    Kumar       9   Hyd       81       83         82    246  82.000000
6     777      AAA       8   Hyd       72       67         79    218  72.666667
12   1443      HHH      10   Hyd       85       89         82    256  85.333333
13   1554      JJJ      11   Hyd       67       72         81    220  73.333333
16   2233  Kumar22       9   Hyd       81       83         82    246  82.000000
20   2237     AAA1       8   Hyd       72       67         79    218  72.666667
*****************

CITY :  Viz

    StdID   SName  SClass SCity  ENGLISH  SCIENCE  COMPUTERS  TOTAL    AVERAGE
1     222   Naren       8   Viz       77       72         77    226  75.333333
4     555     Ram      12   Viz       75       79         85    239  79.666667
8     999     CCC      10   Viz       75       89         67    231  77.000000
10   1221     FFF      10   Viz       82       83         75    240  80.000000
14   1665     KKK      12   Viz       75       83         82    240  80.000000
15   2221  Naren1       8   Viz       77       72         77    226  75.333333
18   2235   Ram44      12   Viz       75       79         85    239  79.666667
22   2239    CCC3      10   Viz       75       89         67    231  77.000000
*****************

In [ ]:
gb_city["TOTAL"].count().max()

8

In [ ]:
gb_city["TOTAL"].count() == 8

SCity
Blr    False
Che    False
Hyd    False
Viz     True
Name: TOTAL, dtype: bool